Ran Plan for project: `ssm/gyanni/ap-northeast-2` dir: `terraform-provisioning/terraform/ssm/gyanni/ap-northeast-2` workspace: `default`

<details><summary>Show Output</summary>

```diff
data.sops_file.secrets_value: Reading...
data.terraform_remote_state.kms: Reading...
data.sops_file.secrets_value: Read complete after 2s [id=-]
data.terraform_remote_state.kms: Read complete after 2s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.coddebuild_github_token.aws_ssm_parameter.ssm will be created
+ resource "aws_ssm_parameter" "ssm" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = "arn:aws:kms:ap-northeast-2:289574460446:key/41c18f93-015f-4ac6-8171-8c6238325eda"
      + name           = "/CodeBuild/GITHUB_TOKEN"
      + region         = "ap-northeast-2"
      + tags_all       = (known after apply)
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.github_token.aws_ssm_parameter.ssm will be created
+ resource "aws_ssm_parameter" "ssm" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = "arn:aws:kms:ap-northeast-2:289574460446:key/41c18f93-015f-4ac6-8171-8c6238325eda"
      + name           = "GITHUB_TOKEN"
      + region         = "ap-northeast-2"
      + tags_all       = (known after apply)
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p ssm/gyanni/ap-northeast-2`
* :put_litter_in_its_place: To **delete** this plan click [here](http://atlantis-402650273.ap-northeast-2.elb.amazonaws.com/lock?id=Gyanni%252Fterraform-playground%252Fterraform-provisioning%252Fterraform%252Fssm%252Fgyanni%252Fap-northeast-2%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p ssm/gyanni/ap-northeast-2`
</details>
Plan: 2 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
